_src/wiki/2016-05-03-mongdb-template.org
*** 使用游标的方式进行分页查询：
#+BEGIN_SRC java
DBObject cond = new BasicDBObject();
//等于条件
cond.put("sex","male");
//非等于条件
cond.put("age", new BasicDBObject(QueryOperators.GTE,20)
            .append(QueryOperators.LTE,30));
//添加or条件（和上面的条件还是and关系）
BasicDBList orList = new BasicDBList();
DBObject orCond1 = new BasicDBObject();
orCond1.put("name", "lisi");
DBObject orCond2 = new BasicDBObject();
orCond2.put("name", "zhaoliu");
orList.add(orCond1);
orList.add(orCond2);
cond.put(QueryOperators.OR, orList);
//限制查询返回的字段
DBObject feild = new BasicDBObject();
feild.put("name", 1);//查询name
feild.put("_id", 0);//_id不查询
//排序字段
DBObject order = new BasicDBObject();
order.put("age",1);
DBCursor dbCursor = mongoTemplate.getCollection("person").find(cond, feild).sort(order).skip(0).limit(10);
System.err.println(dbCursor.count());
System.err.println(dbCursor.toArray());
#+END_SRC

*** 根据某字段去重查询：
#+BEGIN_SRC java
DBObject cond = new BasicDBObject();
cond.put("sex","male");
List distinct = mongoTemplate.getCollection("person").distinct("name",cond);

#+END_SRC

*** 根据查询条件查询条数：
#+BEGIN_SRC java
DBObject cond = new BasicDBObject();
cond.put("sex","male");
long count = mongoTemplate.getCollection("person").count(cond);
System.out.println(count);

#+END_SRC

*** 使用Aggregation Pipeline进行聚群分析：
#+BEGIN_SRC java
List<AggregationOperation> aggregationOptions = new ArrayList<AggregationOperation>();      aggregationOptions.add(Aggregation.match(Criteria.where("province").is("上海")));     aggregationOptions.add(Aggregation.group("age").count().as("count"));
aggregationOptions.add(Aggregation.project("count").and("age").previousOperation().andExclude("_id"));
aggregationOptions.add(Aggregation.sort(Direction.DESC,"age"));
aggregationOptions.add(Aggregation.skip(0L));
aggregationOptions.add(Aggregation.limit(10));
Aggregation agg = Aggregation.newAggregation(aggregationOptions);
AggregationResults<HashMap> aggregate = mongoTemplate.aggregate(agg,"person", HashMap.class);
List<HashMap> mappedResults = aggregate.getMappedResults();
#+END_SRC

其中group后可以添加一些聚合函数，如sum，avg等。如果遇到内嵌文档，需要拆分的情况，
我们可以使用unwind将内嵌文档进行拆分：

: aggregationOptions.add(Aggregation.unwind(field));


*** Spring整合MongoDB实现多个or的范围查询
#+BEGIN_SRC java
Criteria c1= Criteria.where("year").gte(startYear).lte(endYear).and("month").is(endMonth).and("day").gte(startDay).lte(endDay)
            .and("hour").gte(startHour).lte(endHour).and("minute").is(startMinute).and("second").gte(startSecond);
Criteria c2=Criteria.where("year").gte(startYear).lte(endYear).and("month").is(endMonth).and("day").gte(startDay).lte(endDay)
            .and("hour").gte(startHour).lte(endHour).and("minute").is(endMinute).and("second").lte(endSecond);
Criteria c3 =Criteria.where("year").gte(startYear).lte(endYear).and("month").is(endMonth).and("day").gte(startDay).lte(endDay)
            .and("hour").gte(startHour).lte(endHour).and("minute").gt(startMinute).lt(endMinute);
Criteria cr = new Criteria();
query = new Query(cr.orOperator(c1,c2,c3));
getMongoTemplate().find(query, SensorCollection.class);

#+END_SRC

