wiki/2016-05-03-mongdb-template.html

<div id="outline-container-orgf39fb05" class="outline-4">
<h4 id="orgf39fb05">使用游标的方式进行分页查询：</h4>
<div class="outline-text-4" id="text-orgf39fb05">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">cond</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#31561;&#20110;&#26465;&#20214;</span>
cond.put(<span style="font-style: italic;">"sex"</span>,<span style="font-style: italic;">"male"</span>);
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#38750;&#31561;&#20110;&#26465;&#20214;</span>
cond.put(<span style="font-style: italic;">"age"</span>, <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>(<span style="font-weight: bold; text-decoration: underline;">QueryOperators</span>.GTE,20)
            .append(<span style="font-weight: bold; text-decoration: underline;">QueryOperators</span>.LTE,30));
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#28155;&#21152;or&#26465;&#20214;&#65288;&#21644;&#19978;&#38754;&#30340;&#26465;&#20214;&#36824;&#26159;and&#20851;&#31995;&#65289;</span>
<span style="font-weight: bold; text-decoration: underline;">BasicDBList</span> <span style="font-weight: bold; font-style: italic;">orList</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBList</span>();
<span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">orCond1</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
orCond1.put(<span style="font-style: italic;">"name"</span>, <span style="font-style: italic;">"lisi"</span>);
<span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">orCond2</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
orCond2.put(<span style="font-style: italic;">"name"</span>, <span style="font-style: italic;">"zhaoliu"</span>);
orList.add(orCond1);
orList.add(orCond2);
cond.put(<span style="font-weight: bold; text-decoration: underline;">QueryOperators</span>.OR, orList);
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#38480;&#21046;&#26597;&#35810;&#36820;&#22238;&#30340;&#23383;&#27573;</span>
<span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">feild</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
feild.put(<span style="font-style: italic;">"name"</span>, 1);<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#26597;&#35810;name</span>
feild.put(<span style="font-style: italic;">"_id"</span>, 0);<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">_id&#19981;&#26597;&#35810;</span>
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#25490;&#24207;&#23383;&#27573;</span>
<span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">order</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
order.put(<span style="font-style: italic;">"age"</span>,1);
<span style="font-weight: bold; text-decoration: underline;">DBCursor</span> <span style="font-weight: bold; font-style: italic;">dbCursor</span> = mongoTemplate.getCollection(<span style="font-style: italic;">"person"</span>).find(cond, feild).sort(order).skip(0).limit(10);
System.err.println(dbCursor.count());
System.err.println(dbCursor.toArray());
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf09468c" class="outline-4">
<h4 id="orgf09468c">根据某字段去重查询：</h4>
<div class="outline-text-4" id="text-orgf09468c">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">cond</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
cond.put(<span style="font-style: italic;">"sex"</span>,<span style="font-style: italic;">"male"</span>);
<span style="font-weight: bold; text-decoration: underline;">List</span> <span style="font-weight: bold; font-style: italic;">distinct</span> = mongoTemplate.getCollection(<span style="font-style: italic;">"person"</span>).distinct(<span style="font-style: italic;">"name"</span>,cond);

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbb1a5d" class="outline-4">
<h4 id="orgfbb1a5d">根据查询条件查询条数：</h4>
<div class="outline-text-4" id="text-orgfbb1a5d">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold; text-decoration: underline;">DBObject</span> <span style="font-weight: bold; font-style: italic;">cond</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BasicDBObject</span>();
cond.put(<span style="font-style: italic;">"sex"</span>,<span style="font-style: italic;">"male"</span>);
<span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">count</span> = mongoTemplate.getCollection(<span style="font-style: italic;">"person"</span>).count(cond);
System.out.println(count);

</pre>
</div>
</div>
</div>

<div id="outline-container-org3cd3a90" class="outline-4">
<h4 id="org3cd3a90">使用Aggregation Pipeline进行聚群分析：</h4>
<div class="outline-text-4" id="text-org3cd3a90">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold; text-decoration: underline;">List</span>&lt;<span style="font-weight: bold; text-decoration: underline;">AggregationOperation</span>&gt; <span style="font-weight: bold; font-style: italic;">aggregationOptions</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">ArrayList</span>&lt;<span style="font-weight: bold; text-decoration: underline;">AggregationOperation</span>&gt;();      aggregationOptions.add(Aggregation.match(Criteria.where(<span style="font-style: italic;">"province"</span>).is(<span style="font-style: italic;">"&#19978;&#28023;"</span>)));     aggregationOptions.add(Aggregation.group(<span style="font-style: italic;">"age"</span>).count().as(<span style="font-style: italic;">"count"</span>));
aggregationOptions.add(Aggregation.project(<span style="font-style: italic;">"count"</span>).and(<span style="font-style: italic;">"age"</span>).previousOperation().andExclude(<span style="font-style: italic;">"_id"</span>));
aggregationOptions.add(Aggregation.sort(<span style="font-weight: bold; text-decoration: underline;">Direction</span>.DESC,<span style="font-style: italic;">"age"</span>));
aggregationOptions.add(Aggregation.skip(0L));
aggregationOptions.add(Aggregation.limit(10));
<span style="font-weight: bold; text-decoration: underline;">Aggregation</span> <span style="font-weight: bold; font-style: italic;">agg</span> = Aggregation.newAggregation(aggregationOptions);
<span style="font-weight: bold; text-decoration: underline;">AggregationResults</span>&lt;<span style="font-weight: bold; text-decoration: underline;">HashMap</span>&gt; <span style="font-weight: bold; font-style: italic;">aggregate</span> = mongoTemplate.aggregate(agg,<span style="font-style: italic;">"person"</span>, HashMap.<span style="font-weight: bold;">class</span>);
<span style="font-weight: bold; text-decoration: underline;">List</span>&lt;<span style="font-weight: bold; text-decoration: underline;">HashMap</span>&gt; <span style="font-weight: bold; font-style: italic;">mappedResults</span> = aggregate.getMappedResults();
</pre>
</div>

<p>
其中group后可以添加一些聚合函数，如sum，avg等。如果遇到内嵌文档，需要拆分的情况，
我们可以使用unwind将内嵌文档进行拆分：
</p>

<pre class="example">
aggregationOptions.add(Aggregation.unwind(field));

</pre>
</div>
</div>


<div id="outline-container-org16eeac1" class="outline-4">
<h4 id="org16eeac1">Spring整合MongoDB实现多个or的范围查询</h4>
<div class="outline-text-4" id="text-org16eeac1">
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold; text-decoration: underline;">Criteria</span> <span style="font-weight: bold; font-style: italic;">c1</span>= Criteria.where(<span style="font-style: italic;">"year"</span>).gte(startYear).lte(endYear).and(<span style="font-style: italic;">"month"</span>).is(endMonth).and(<span style="font-style: italic;">"day"</span>).gte(startDay).lte(endDay)
            .and(<span style="font-style: italic;">"hour"</span>).gte(startHour).lte(endHour).and(<span style="font-style: italic;">"minute"</span>).is(startMinute).and(<span style="font-style: italic;">"second"</span>).gte(startSecond);
<span style="font-weight: bold; text-decoration: underline;">Criteria</span> <span style="font-weight: bold; font-style: italic;">c2</span>=Criteria.where(<span style="font-style: italic;">"year"</span>).gte(startYear).lte(endYear).and(<span style="font-style: italic;">"month"</span>).is(endMonth).and(<span style="font-style: italic;">"day"</span>).gte(startDay).lte(endDay)
            .and(<span style="font-style: italic;">"hour"</span>).gte(startHour).lte(endHour).and(<span style="font-style: italic;">"minute"</span>).is(endMinute).and(<span style="font-style: italic;">"second"</span>).lte(endSecond);
<span style="font-weight: bold; text-decoration: underline;">Criteria</span> <span style="font-weight: bold; font-style: italic;">c3</span> =Criteria.where(<span style="font-style: italic;">"year"</span>).gte(startYear).lte(endYear).and(<span style="font-style: italic;">"month"</span>).is(endMonth).and(<span style="font-style: italic;">"day"</span>).gte(startDay).lte(endDay)
            .and(<span style="font-style: italic;">"hour"</span>).gte(startHour).lte(endHour).and(<span style="font-style: italic;">"minute"</span>).gt(startMinute).lt(endMinute);
<span style="font-weight: bold; text-decoration: underline;">Criteria</span> <span style="font-weight: bold; font-style: italic;">cr</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Criteria</span>();
query = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Query</span>(cr.orOperator(c1,c2,c3));
getMongoTemplate().find(query, SensorCollection.<span style="font-weight: bold;">class</span>);

</pre>
</div>
</div>
</div>
</div>
