_src/wiki/2016-05-03-mongdb-template.org
** 附带Criteria方法：
|                                           | Mongodb | 说明     |
|-------------------------------------------+---------+----------|
| Criteria and (String key)                 | $and    | 并且     |
| Criteria andOperator (Criteria…​ criteria) | $and    | 并且     |
| Criteria orOperator (Criteria…​ criteria)  | $or     | 或者     |
| Criteria gt (Object o)                    | $gt     | 大于     |
| Criteria gte (Object o)                   | $gte    | 大于等于 |
| Criteria in (Object…​ o)                   | $in     | 包含     |
| Criteria is (Object o)                    | $is     | 等于     |
| Criteria lt (Object o)                    | $lt     | 小于     |
| Criteria lte (Object o)                   | $lte    | 小等于   |
| Criteria nin (Object…​ o)                  | $nin    | 不包含   |
|-------------------------------------------+---------+----------|
