wiki/2016-05-03-mongdb-template.html

<div id="outline-container-orgd224f13" class="outline-3">
<h3 id="orgd224f13">附带Criteria方法：</h3>
<div class="outline-text-3" id="text-orgd224f13">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Mongodb</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Criteria and (String key)</td>
<td class="org-left">$and</td>
<td class="org-left">并且</td>
</tr>

<tr>
<td class="org-left">Criteria andOperator (Criteria…​ criteria)</td>
<td class="org-left">$and</td>
<td class="org-left">并且</td>
</tr>

<tr>
<td class="org-left">Criteria orOperator (Criteria…​ criteria)</td>
<td class="org-left">$or</td>
<td class="org-left">或者</td>
</tr>

<tr>
<td class="org-left">Criteria gt (Object o)</td>
<td class="org-left">$gt</td>
<td class="org-left">大于</td>
</tr>

<tr>
<td class="org-left">Criteria gte (Object o)</td>
<td class="org-left">$gte</td>
<td class="org-left">大于等于</td>
</tr>

<tr>
<td class="org-left">Criteria in (Object…​ o)</td>
<td class="org-left">$in</td>
<td class="org-left">包含</td>
</tr>

<tr>
<td class="org-left">Criteria is (Object o)</td>
<td class="org-left">$is</td>
<td class="org-left">等于</td>
</tr>

<tr>
<td class="org-left">Criteria lt (Object o)</td>
<td class="org-left">$lt</td>
<td class="org-left">小于</td>
</tr>

<tr>
<td class="org-left">Criteria lte (Object o)</td>
<td class="org-left">$lte</td>
<td class="org-left">小等于</td>
</tr>

<tr>
<td class="org-left">Criteria nin (Object…​ o)</td>
<td class="org-left">$nin</td>
<td class="org-left">不包含</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
